[
    {
        "image": "assets//images//airport2.png",
        "link":"https://github.com/sxntixgxs/ProyectoTallerDB",
        "title": "Airport manager",
        "description": " The project adopts a hexagonal architecture combined with vertical slicing, enabling modular design and scalability. The architecture separates concerns by organizing the code into distinct packages: domain for business entities and logic, application for use cases, and infrastructure for external interactions like databases and APIs. This structure enhances the system's maintainability and adaptability, ensuring clear boundaries between core functionalities and external services​ (GitHub).",
        "technologies": ["JAVA", "MySQL"]
    },
    {   
        "image": "assets//images//automotriz.png",
        "link":"https://github.com/sxntixgxs/ProyectoTallerDB",
        "title": "Auto repair shop",
        "description": "database-focused project designed to manage the operations of an automotive repair shop. It leverages MySQL for data management, organizing critical information such as inventory levels, client records, repair services, and billing details. The project includes various SQL queries to perform tasks like inventory tracking, scheduling appointments, generating invoices, and calculating repair costs. The architecture is centered around relational database principles, ensuring efficient data retrieval and integrity through the use of joins, stored procedures, and aggregate functions",
        "technologies": ["MySQL"]
    },
    {
        "image": "/assets/images/whatchat.png",
        "link":"https://whatchat.co/",
        "title": "Whatchat",
        "description": "WatchChat is a comprehensive customer relationship management (CRM) platform designed to centralize and optimize the management of conversations across various social media channels. The platform integrates with popular messaging services like WhatsApp, Facebook, and Instagram, allowing businesses to handle multiple customer interactions in one place. WatchChat leverages APIs for seamless integration with existing systems like CRMs or customer data platforms (CDPs), enhancing communication strategies through real-time analytics, message segmentation, and customizable automation. The system also includes mobile apps for both Android and iOS, ensuring that teams can manage customer interactions on the go​ ",
        "technologies": ["WordPress", "React Native"]
    },
    {
        "image": "/assets/images/prime.png",
        "link":"https://github.com/sxntixgxs/proyectoJS/tree/main/PRIME",
        "title": "PRIME",
        "description": "PRIME is a front-end web project focused on creating interactive and responsive user interfaces using JavaScript, HTML, and CSS. The project demonstrates proficiency in client-side development by employing modern JavaScript techniques to enhance user experience and interface behavior. The structure of the codebase emphasizes separation of concerns, ensuring that the styling, structure, and logic are cleanly divided and maintainable. This project serves as a solid example of applying best practices in front-end development to build efficient and user-friendly web applications​",
        "technologies": ["JavaScript", "CSS", "HTML","Chart.js"]
    }
]
